TDPortal/Utilities/EnhancedExposedServicesTestTool/ExposedServicesTestToolClient/Requests/CodeService/V1/INVALID_CodeService_FindCodeRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <FindCode xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.CodeHandler.V1">
      <transactionId>115121321312</transactionId>
      <language>en-GB</language>
      <code>1000DBNR4070xxxxx</code>
    </FindCode>
  </soap:Body>
</soap:Envelope>